Importing SQLite3 Module and Connecting to the Database and Creating a Database

In [1]:
import sqlite3
connection = sqlite3.connect("movies.db")

Creating a cursor to execute queries and Creating a Table

In [2]:
cursor = connection.cursor()
cursor.execute(" CREATE TABLE movies (name TEXT, actor TEXT, actress TEXT, director TEXT, year INTEGER)")

Inserting Values into the Movies Table

In [3]:
cursor.execute("INSERT INTO movies VALUES('war','Hrithik','Vaani Kapoor','Siddharth',2019)")
cursor.execute("INSERT INTO movies VALUES('3 Idiots', 'Aamir Khan','Kareena Kapoor','RajKumar Hirani',2009)")
cursor.execute("INSERT INTO movies VALUES('Zero','SRK','katrina','Aanand',2018)")
cursor.execute("INSERT INTO movies VALUES('Sanju','Ranbir','Sonam','Rajkumar',2018)")
cursor.execute("INSERT INTO movies VALUES('Raees','SRK','Maahira','Rahul',2017)")

Reading Data from the Database and Simple SELECT statement to query all rows from the Movies table

In [6]:
rows = cursor.execute("SELECT * FROM movies").fetchall()
for i in rows:
  name,actor,actress,director,year = i
  print(name+"\t"+actor+"\t"+actress+"\t"+director+"\t"+str(year))

war	Hrithik	Vaani Kapoor	Siddharth	2019
3 Idiots	Aamir Khan	Kareena Kapoor	RajKumar Hirani	2009
Zero	SRK	katrina	Aanand	2018
Sanju	Ranbir	Sonam	Rajkumar	2018
Raees	SRK	Maahira	Rahul	2017

Query with parameter like actor name to select movies based on the actor's name.

In [7]:
actor_rows = cursor.execute("SELECT * FROM movies WHERE actor='SRK'").fetchall()
for i in actor_rows:
  name,actor,actress,director,year = i
  print(name+"\t"+actor+"\t"+actress+"\t"+director+"\t"+str(year))

Zero	SRK	katrina	Aanand	2018
Raees	SRK	Maahira	Rahul	2017